Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: To write the filenames on the clipboard to a file, use FileAppend A_Clipboard "`r`n", "C:\My File.txt".
ja: クリップボード上のファイル名をファイルに書き込むには、FileAppend A_Clipboard "`r`n", "C:\My File.txt"とします。

source: To write the text to a file, follow this example:
ja: テキストをファイルに書き出すには、この例に従います：

source: To write the text to a file, follow this example: FileAppend(MyEdit.Text, "C:\Saved File.txt").
ja: テキストをファイルに書き出すには、この例に従います：FileAppend(MyEdit.Text, "C:\Saved File.txt")。

source: Toggles CapsLock to its opposite state.
ja: CapsLockを反対の状態に切り替えます。

source: Toggles the "hidden" attribute of a single directory.
ja: 単一ディレクトリの「隠しファイル」属性を切り替えます。

source: Toggles the WS_EX_TOOLWINDOW attribute, which removes/adds Notepad from the alt-tab list.
ja: WS_EX_TOOLWINDOW属性をトグルし、altタブのリストからメモ帳を削除/追加します。

source: Toggles the always-on-top status of the calculator.
ja: 電卓を常に表示するかどうかを切り替えます。

source: Toggles the checkmark next to a menu item.
ja: メニューの横にあるチェックマークを切り替えます。

source: Toggles the master mute (sets it to the opposite of its current state).
ja: マスターミュートを現在とは逆の状態に切り替えます。

source: Toggles the master mute (sets it to the opposite state).
ja: マスターミュートを切り替える（逆の状態にする）。

source: Toggles the pause state of the underlying thread.
ja: 基礎となるスレッドの一時停止状態をトグルします。

source: ToolTip ; Turn off the tip.
ja: ToolTip ; チップを切る。

source: ToolTip - Syntax & Usage | AutoHotkey v2
ja: ToolTip - 構文と使用法｜AutoHotkey v2

source: ToolTip DllCall("GetScrollPos", "Ptr", FocusedHwnd, "Int", 1) ; Last parameter is 1 for SB_VERT, 0 for SB_HORZ.
ja: ToolTip DllCall("GetScrollPos", "Ptr", FocusedHwnd, "Int", 1) ; SB_VERTの場合は1、SB_HORZの場合は0になります。

source: ToolTip Mouse Menu
ja: ツールチップマウスメニュー

source: Top-level class definitions now create a constant (read-only variable); that is, assigning to a class name is now an error rather than an optional warning, except where a local variable shadows the global class (which now occurs by default when assigning inside a function).
ja: つまり、クラス名への代入は、ローカル変数がグローバルクラスの影になる場合（関数内で代入する場合はデフォルトで発生）を除き、オプションの警告ではなく、エラーになるようになりました。

source: Traditionally, the top of the script has been referred to as the auto-execute section.
ja: 伝統的に、スクリプトの最上部は自動実行セクションと呼ばれてきた。

source: Trailing zeros are truncated, and the decimal point appears only if one or more digits follow it.
ja: 末尾のゼロは切り捨てられ、小数点は1桁以上続く場合のみ表示されます。

source: Transform's Unicode sub-command is unavailable on Unicode versions
ja: TransformのUnicodeサブコマンドは、Unicodeバージョンでは利用できない

source: Transforms a YYYYMMDDHH24MISS timestamp into the specified date/time format.
ja: けYYYYMMDDHH24MISS形式のタイムスタンプを指定された日付/時刻形式に変換します。

source: Tray := A_TrayMenu ; For convenience.
ja: Tray := A_TrayMenu ; 便宜上

source: Tray Icon
ja: トレイアイコン

source: Tray.Delete() ; Delete the standard items.
ja: Tray.Delete() ; 標準の項目を削除する。

source: Tray.Enable("TestToggleEnable") ; Also enables the next test since it can't undo the disabling of itself.
ja: Tray.Enable("TestToggleEnable") ; 自分自身の無効化を取り消すことができないので、次のテストも有効にします。

source: TraySetIcon - Syntax & Usage | AutoHotkey v2
ja: TraySetIcon - 構文と使用法｜AutoHotkey v2

source: TrayTip - Syntax & Usage | AutoHotkey v2
ja: TrayTip - 構文と使用法｜AutoHotkey v2

source: TrayTip also has no effect if the following REG_DWORD value exists and has been set to 0:
ja: また、以下のREG_DWORD値が存在し、0に設定されている場合、TrayTipは効果を発揮しません：

source: TrayTip has no effect if the script lacks a tray icon (via #NoTrayIcon or A_IconHidden := true).
ja: TrayTipは、スクリプトにトレイアイコンがない場合（#NoTrayIconまたはA_IconHidden := trueを使用）には効果がありません。

source: TrayTip now shows even if Text is omitted (which is now harder to do by accident than in v1).
ja: Textが省略されてもTrayTipが表示されるようになった（v1より誤ってやってしまいにくくなりました）。

source: Treats each backtick character literally rather than as an escape character.
ja: 各バックティック文字をエスケープ文字としてではなく、文字通りに扱う。

source: Tree View eXtension (TVX) extends TreeViews to support moving, inserting and deleting.
ja: Tree View eXtension (TVX) はTreeViewを拡張し、移動、挿入、削除をサポートします。

source: TreeView (GUI) - Syntax & Usage | AutoHotkey v2
ja: TreeView（GUI）- 構文と使用法｜AutoHotkey v2

source: TreeView Control Styles
ja: TreeViewコントロールのスタイル

source: Trial and Error
ja: 試行錯誤

source: Trial and Error is a very common and effective way of learning.
ja: 試行錯誤は非常に一般的で効果的な学習方法である。

source: Trigonometry
ja: 三角法

source: Trim / LTrim / RTrim - Syntax & Usage | AutoHotkey v2
ja: Trim / LTrim / RTrim - 構文と使用法｜AutoHotkey v2

source: Trims all spaces from the left and right side of a string.
ja: 文字列の左右の空白をすべて取り除きます。

source: Trims all zeros from the left side of a string.
ja: 文字列の左側からすべてのゼロをトリムする。

source: Trims certain characters, such as a single period at the end of a component (dir.\file) or trailing spaces and periods (dir\filename . .).
ja: コンポーネント（dir.\file）の末尾のピリオド1個や、末尾のスペースやピリオド（dir\filename . .）など、特定の文字をトリムする。

source: Trims characters from the beginning and/or end of a string.
ja: 文字列の先頭や末尾から文字を切り取ります。

source: Triple-click the newly added item (cmd.exe) in the ListBox and rename it to your choice (e.g. Launch Script).
ja: ListBoxに新しく追加された項目（cmd.exe）をトリプルクリックし、任意の名前に変更します（例：Launch Script)。

source: True and False (still exist, but are now only keywords, not variables)
ja: 真と偽（まだ存在しますが、現在はキーワードのみで、変数ではありません）

source: True if IsInteger(Value) or IsFloat(Value) is true.
ja: IsInteger(Value) or IsFloat(Value)が真であれば真。

source: True if Value is a floating point number or a purely numeric string containing a decimal point.
ja: Valueが浮動小数点数または小数点を含む純粋な数値文字列である場合に真となります。

source: True if Value is a positive integer, an empty string, or a string which contains only the characters 0 through 9.
ja: Valueが正の整数、空文字列、または 0 から 9 までの文字のみを含む文字列の場合、真。

source: True if Value is a string and is empty or contains only alphabetic characters.
ja: Valueが文字列で、空であるか、アルファベット文字のみを含む場合に真となります。

source: True if Value is a string and is empty or contains only lowercase characters.
ja: Valueが文字列で、空であるか、小文字のみを含む場合に真とします。

source: True if Value is a string and is empty or contains only uppercase characters.
ja: Valueが文字列で、空であるか、大文字のみを含む場合に真とします。

source: True if Value is a string and is empty or contains only whitespace consisting of the following characters:
ja: Valueが文字列で、空であるか、または以下の文字からなる空白のみを含む場合に真とします：

source: True if Value is a string and is empty or contains only whitespace consisting of the following characters: space (A_Space or `s), tab (A_Tab or `t), linefeed (`n), return (`r), vertical tab (`v), and formfeed (`f).
ja: Valueが文字列で、空であるか、または以下の文字からなる空白のみを含む場合に真とします：スペース（A_Spaceまたは `s）、タブ（A_Tabまたは `t）、ラインフィード（`n）、リターン（`r）、垂直タブ（`v）、フォームフィード（`f）。

source: True if Value is a valid date-time stamp, which can be all or just the leading part of the YYYYMMDDHH24MISS format.
ja: Valueが有効な日付-時間スタンプであれば真。YYYYMMDDHH24MISSフォーマットの先頭部分のみでもよいです。

source: True if Value is an object.
ja: Valueが オブジェクトの場合、真。

source: True if Value is an integer or a purely numeric string (decimal or hexadecimal) without a decimal point.
ja: Valueが整数または小数点を含まない純粋な数値文字列（10進数または16進数）である場合に真となる。

source: True if Value is the name of a label defined within the current scope.
ja: Valueが現在のスコープ内で定義されたラベルの名前である場合、真となる。

source: True if the VarRef contained by Value has been assigned a value.
ja: Valueが含むVarRefに値が割り当てられている場合は真。

source: True if the variable Value has been assigned a value.
ja: 変数Valueに値が割り当てられている場合、真。

source: Truncate property values at the first null-character, since AutoHotkey currently returns the entire variable contents and XDebugClient has no suitable interface for displaying binary content.
ja: AutoHotkeyは現在、変数の内容全体を返し、XDebugClientにはバイナリコンテンツを表示するための適切なインターフェースがないため、最初のヌル文字でプロパティ値を切り詰めます。

source: Try - Syntax & Usage | AutoHotkey v2
ja: Try - 構文と使用法｜AutoHotkey v2

source: Try AHKHID from the archived forum.
ja: フォーラムのアーカイブを検索してAHKHIDを試してみてください。

source: Try AHKHID.
ja: AHKHIDを試してみてください。

source: Try ControlSend, which might work in cases where the other Send modes fail:
ja: 他の送信モードに失敗した場合に有効な場合があるControlSendをお試しください：

source: Try making the following changes to the example above:
ja: 上の例で、次のように変更してみてください：

source: Try making the following changes to the example:
ja: 例題に次のような変更を加えてみてください：

source: Try running this example and opening the main window as described above:
ja: この例を実行し、上記のようにメインウィンドウを開いてみてください：

source: Try the down and up event of a key with a Sleep between them:
ja: スリープを挟んだキーのダウンとアップのイベントを試してみてください：

source: Try the down and up event of a key with the various send methods:
ja: キーのダウン、アップのイベントを各種送信方法で試してみる：

source: Try using a different character that you know exists in your keyboard layout.
ja: キーボードレイアウトに存在することが分かっている別の文字を使用してみてください。

source: Try, fail, try, fail, try, try, try, fail, fail, succeed!
ja: トライ、失敗、トライ、失敗、トライ、トライ、失敗、成功！

source: Try-catch syntax has changed to allow the script to catch specific error classes, while leaving others uncaught.
ja: Try-catchの構文が変更され、スクリプトが特定のエラークラスをキャッチし、他のエラークラスをキャッチしないようにすることができるようになりました。

source: Trying the examples
ja: 例題の試用

source: Turn Volume Down
ja: 音量を下げる

source: Turn Volume Up
ja: 音量を上げる

source: Turn the wheel downward (toward you).
ja: ホイールを下（手前）に回します。

source: Turn the wheel upward (away from you).
ja: ホイールを上（自分から離れる方向）に回します。

source: Turning off DetectHiddenText can be useful in cases where you want to detect the difference between the different panes of a multi-pane window or multi-tabbed dialog.
ja: DetectHiddenTextをオフにすると、マルチペインウィンドウやマルチタブダイアログの異なるペイン間の違いを検出したい場合に便利です。

source: Turning on case-sensitivity (C) or word-sensitivity (?) also affects which existing hotstrings will be found by any subsequent calls to the Hotstring function.
ja: 大文字小文字の区別（C）や単語の区別（？）をオンにすると、それ以降にHotstring関数を呼び出したときに、どの既存のホットストリングが見つかるかにも影響します。

source: Turning on DetectHiddenWindows can make scripting harder in some cases since some hidden system windows might accidentally match the title or text of another window you're trying to work with.
ja: DetectHiddenWindowsをオンにすると、隠れているシステムウィンドウの一部が、操作しようとしている他のウィンドウのタイトルやテキストと偶然に一致することがあるため、場合によってはスクリプトが難しくなることがあります。

source: Turning on DetectHiddenWindows is not necessary in the following cases:
ja: 以下の場合は、DetectHiddenWindowsをオンにする必要はありません：

source: Turning this directive ON is equivalent to using the $ prefix in the definition of each affected hotkey.
ja: このディレクティブをオンにすると、影響を受ける各ホットキーの定義に$ prefixを使用することと同じになります。

source: Turns off both the Send and the Mouse modes, but does not change the current state of input blocking.
ja: 送信モードとマウスモードの両方をオフにしますが、入力ブロックの現在の状態は変更しません。

source: Turns off the "read-only" attribute and turns on the "archive" attribute of a single file.
ja: 単一ファイルの「読み取り専用」属性をオフにし、「アーカイブ」属性をオンにします。

source: Turns off the detection of hidden text.
ja: 隠しテキストの検出をオフにします。

source: Turns off the key and removes the AlwaysOn/Off attribute of the key (if present).
ja: キーをオフにし、キーの AlwaysOn/Off 属性を削除します（存在する場合）。

source: Turns off the master mute.
ja: マスターミュートをオフにします。

source: Turns off the monitor via hotkey.
ja: ホットキーでモニターをオフにします。

source: Turns off the omission of spaces and tabs from the beginning of each line.
ja: 行頭のスペースとタブの省略をオフにする。

source: Turns off the omission of spaces and tabs from the end of each line.
ja: 行末のスペースとタブの省略をオフにする。

source: Turns on (checks) or turns off (unchecks) a checkbox or radio button.
ja: チェックボックスやラジオボタンをオン（チェック）またはオフ（チェック解除）します。

source: Turns on NumLock and removes the AlwaysOn/Off attribute of the key (if present).
ja: NumLockをオンにし、キーのAlwaysOn/Off属性を削除します（存在する場合）。

source: Turns on the "read-only" and "hidden" attributes of all files and directories (subdirectories are not recursed into).
ja: すべてのファイルとディレクトリの「読み取り専用」と「隠しファイル」属性をオンにします（サブディレクトリは再帰されません）。

source: Turns on the detection of hidden windows.
ja: 隠しウィンドウの検出をオンにします。

source: Turns on the key and removes the AlwaysOn/Off attribute of the key (if present).
ja: キーをオンにし、キーのAlwaysOn/Off属性（存在する場合）を削除します。

source: Turns on the master mute.
ja: マスターミュートをオンにします。

source: Tutorials:
ja: チュートリアル：

source: Two consecutive commas results in a single literal comma.
ja: カンマが2つ続くと、文字通りのカンマ1つとなります。

source: Two examples:
ja: 例を2つ挙げる：

source: Two object references compare equal only if they refer to the same object.
ja: 2つのオブジェクトの参照は、同じオブジェクトを参照している場合のみ、等しく比較されます。

source: Type "Hello, world!"
ja: 「Hello, world!」と入力する

source: Type - Syntax & Usage | AutoHotkey v2
ja: Type - 構文と使用法｜AutoHotkey v2

source: Type Char
ja: 型キャラクター

source: Type Character
ja: 型キャラクター

source: Type is now mandatory for NumGet as well.
ja: NumGetでもTypeが必須となりました。

source: Type names used with DllCall, NumPut or NumGet.
ja: DllCall、NumPut、NumGetで使用される型名です。

source: Type your abbreviation at the indicated insertion point.
ja: 表示された挿入口に略号を入力してください。

source: Type your abreviation at the indicated insertion point.
ja: 表示された挿入口に略号を入力してください。

source: Type:
ja: 型：

source: Type: Any
ja: 型：任意

source: Type: Array
ja: 型：配列

source: Type: Boolean
ja: 型：論理値

source: Type: Class
ja: 型：Class

source: Type: ComObject
ja: 型：ComObject

source: Type: Float
ja: 型：浮動小数点数

source: Type: Function Object
ja: 型：機能オブジェクト

source: Type: Function Object or String
ja: 型：機能オブジェクトまたは文字列

source: Type: Function Object or Menu
ja: 型：機能オブジェクトまたはMenu

source: Type: Integer (boolean)
ja: 型：整数（ブーリアン）

source: Type: Integer (boolean) or Integer
ja: 型：整数（ブーリアン）または整数

source: Type: Integer (boolean) or String
ja: 型：整数（ブーリアン）または文字列

source: Type: Integer (boolean), Float, Integer or String (empty)
ja: 型：整数（ブーリアン）、浮動小数点数、整数または文字列（空）

source: Type: Integer or Float
ja: 型：整数または浮動小数点数

source: Type: Integer or Object
ja: 型：整数またはオブジェクト

source: Type: Integer or String (empty)
ja: 型：整数または文字列（空）

source: Type: Integer or String
ja: 型：整数または文字列

source: Type: Integer, Object or String
ja: 型：整数、オブジェクト または 文字列

source: Type: Object
ja: 型：オブジェクト

source: Type: Object or Integer
ja: 型：オブジェクトまたは整数

source: Type: Object or String (empty)
ja: 型：オブジェクトまたは文字列（空）

source: Type: Object, String or Integer
ja: 型：オブジェクト、文字列または整数

source: Type: String
ja: 型：文字列

source: Type: String or Array
ja: 型：文字列または配列

source: Type: String or Function Object
ja: 型：文字列または関数オブジェクト

source: Type: String or Integer (boolean)
ja: 型：文字列 or 整数（ブーリアン）

source: Type: String or Integer
ja: 型：文字列または整数

source: Type: String or Object
ja: 型：文字列またはオブジェクト

source: Type: String, Integer or Float
ja: 型：文字列、整数または浮動小数点数

source: Type: String, Integer or Object
ja: 型：文字列、整数またはオブジェクト

source: Type: VarRef
ja: 型：VarRef

source: Type: Variable
ja: 型：変数

source: Type: ComObjArray
ja: 型：ComObjArray

source: Types
ja: 種類

source: Types a two-line signature.
ja: 2行の署名を入力します。

source: Types of Arguments and Return Values
ja: 引数の種類と戻り値

source: Types which aren't specifically handled are coerced to strings via VariantChangeType; if this fails or if the variant type contains the VT_ARRAY or VT_BYREF flag, an object containing both the value and its type is returned instead.
ja: 特に扱われていない型は、VariantChangeTypeによって文字列に強制されます。もしこれが失敗したり、Variant型にVT_ARRAYやVT_BYREFフラグが含まれている場合、代わりに値とその型の両方を含むオブジェクトが返されます。

source: Typical for removable drives that don't contain media.
ja: メディアを含まないリムーバブルドライブの代表的なものです。

source: Typically full paths and quote marks would be used for the path to AutoHotkeyUX.exe and launcher.ahk, which can be found in the UX subdirectory of the AutoHotkey installation.
ja: 通常、AutoHotkeyインストレーションのUXサブディレクトリにあるAutoHotkeyUX.exeとlauncher.ahkへのパスには、フルパスと引用符を使用します。

source: Typically one of the following errors may be thrown:
ja: 通常、以下のようなエラーが発生することがあります：

source: Typically performs the same function as Browser_Back.
ja: 通常、Browser_Back と同じ機能を実行します。

source: Typically performs the same function as Browser_Forward.
ja: 通常、Browser_Forward と同じ機能を実行します。

source: Typically the following actions are possible:
ja: 通常、以下のようなアクションが可能である：

source: Typically the object would be a Buffer.
ja: 通常、オブジェクトはBufferとなります。

source: Typically used with function definitions and control flow statements.
ja: 一般に、関数定義や 制御フロー文と一緒に使用されます。

source: Typing text is simpler, so we'll start there:
ja: 文字入力の方が簡単なので、まずはそこから。

source: Typing text is simpler, so we'll start there: just call the SendText function, passing it the exact text you want to send.
ja: 文字入力の方が簡単なので、まずはそこから。SendText関数を呼び出し、送信したいテキストを正確に渡すだけです。

source: U (prefix)
ja: U（接頭）

source: U or u (uppercase), L or l (lowercase), T or t (title case, in which the first letter of each word is capitalized but all others are made lowercase).
ja: Uまたはu（大文字）、Lまたはl（小文字）、Tまたはt（タイトルケース、各単語の最初の文字を大文字にし、他を小文字にしたもの）。

source: UAC may also prevent SendPlay and BlockInput from working.
ja: また、UACによりSendPlayや BlockInputが動作しない場合があります。

source: UD Digi Kyokasho N-B
ja: UD デジタル 教科書体 N-B

source: UD Digi Kyokasho N-R
ja: UD デジタル 教科書体 N-R

source: UD Digi Kyokasho NK-B
ja: UD デジタル 教科書体 NK-B

source: UD Digi Kyokasho NK-R
ja: UD デジタル 教科書体 NK-R

source: UD Digi Kyokasho NP-B
ja: UD デジタル 教科書体 NP-B

source: UD Digi Kyokasho NP-R
ja: UD デジタル 教科書体 NP-R

source: UIA is only effective if the file is in a trusted location; i.e. a Program Files sub-directory.
ja: UIAは、ファイルが信頼できる場所、すなわちProgram Filesサブディレクトリにある場合にのみ有効です。

source: UIA prevents the Gui +Parent option from working on an existing window if the new parent is always-on-top and the child window is not.
ja: 新しい親ウィンドウが常に上にあり、子ウィンドウが常に上にない場合、UIAはGui+Parentオプションが既存のウィンドウ上で機能するのを防ぎます。

source: UIA.exe files cannot be modified, as it would invalidate the file's digital signature.
ja: ファイルのデジタル署名が無効になるため、UIA.exeファイルを変更することはできません。

source: UIA.exe files cannot be started via CreateProcess due to security restrictions.
ja: セキュリティ上の制限により、UIA.exeファイルをCreateProcessで起動することはできません。

source: UIA.exe files created on one computer cannot run on other computers without first installing the digital certificate which was used to sign them.
ja: あるコンピュータで作成されたUIA.exeファイルは、その署名に使用されたデジタル証明書を最初にインストールしない限り、他のコンピュータで実行することはできません。

source: URL := SubStr(URLSearchString, URLStart) ; Omit the beginning/irrelevant part.
ja: URL := SubStr(URLSearchString, URLStart) ; 先頭/関係ない部分を省略します。

source: URL of the file to download.
ja: ダウンロードするファイルのURL。

source: URL.Value := NewURL ; Update the URL edit control.
ja: URL.Value := NewURL ; URLエディットコントロールをアップデートします。

source: URLStart := 0 ; Set starting default.
ja: URLStart := 0 ; 開始時のデフォルトを設定する。

source: UTC is essentially the same as Greenwich Mean Time (GMT).
ja: UTCは基本的にグリニッジ標準時（GMT）と同じである。

source: UTC_Delta := DateDiff(A_Now, A_NowUTC, "Seconds") ; Seconds is more accurate due to rounding issue.
ja: UTC_Delta := DateDiff(A_Now, A_NowUTC, "Seconds") ; 四捨五入の関係で、「秒」の方が正確です。

source: UTC_Delta := Round(-UTC_Delta/60) ; Round to nearest minute to ensure accuracy.
ja: UTC_Delta := Round(-UTC_Delta/60) ; 正確を期すため、分単位に丸めて表示します。

source: Unambiguous use of continuation by enclosure or end-of-line continuation operators.
ja: 囲みまたは行末の継続演算子による継続の明確な使用。

source: Unambiguous use of 'single quotes' or fat arrow => in an expression.
ja: 式の中で'一重引用符'または太い矢印=>を明確に使用する。

source: Unbound parameter positions are assigned positions from the caller's parameter list, left to right.
ja: 未束縛のパラメータ位置は、呼び出し元のパラメータリストから左から右へと割り当てられる。

source: Uncategorized
ja: 未分類（Uncategorized）

source: Uncollapsed (default)
ja: 広げた状態（初期値）

source: Uncomment the first line to overwrite rather than append to any existing file.
ja: 1行目のコメントを外すと、既存のファイルに追記するのではなく、上書きされます。

source: Uncommon Styles and Options
ja: 一般的でないスタイルとオプション

source: Under most conditions, this is equivalent to explicitly anchoring the pattern by means such as "^".
ja: ほとんどの条件下では、これは「^」のような手段でパターンを明示的に固定することと同じである。

source: Under other conditions (caused by OS behavior) such as the window having been minimized, restored, and/or resized since it was made transparent.
ja: ウィンドウが透明になった後に最小化、復元、サイズ変更されるなど、その他の条件下の場合（OS の動作によって引き起こされます）。

source: Unfilled fields are set to zero.
ja: 未記入のフィールドはゼロに設定される。

source: Unfortunately, this style has no effect on the actual behavior of the control, so there is probably no point in using it (instead, use +Invert in the control's options to reverse it).
ja: 残念ながら、このスタイルはコントロールの実際の動作には影響しないので、使う意味はないだろう（代わりに、コントロールのオプションで+Invertを使って反転させる）。

source: Unfortunately, this style has no effect on the actual behavior of the control, so there is probably no point in using it.
ja: 残念ながら、このスタイルはコントロールの実際の動作には影響しないので、使う意味はないだろう。

source: Unhides and maximizes the window.
ja: ウィンドウの非表示と最大化を解除します。

source: Unhides and minimizes the window.
ja: ウィンドウの非表示と最小化を行います。

source: Unhides and restores the window, if it was minimized or maximized beforehand.
ja: ウィンドウがあらかじめ最小化または最大化されている場合は、非表示にしたり元に戻したりします。

source: Unhides the specified window.
ja: 指定したウィンドウの非表示を解除します。

source: Unhides the window (if necessary) and maximizes it.
ja: ウィンドウの非表示を解除し（必要な場合）、最大化します。

source: Unhides the window (if necessary) and minimizes it.
ja: ウィンドウの非表示を解除し（必要な場合）、最小化します。

source: Unhides the window (if necessary) and restores it, if it was minimized or maximized beforehand.
ja: ウィンドウが最小化または最大化されている場合、必要に応じてウィンドウの非表示を解除し、元に戻します。

source: Unicode UTF-16 with little endian byte order, equivalent to CP1200.
ja: CP1200 に相当するリトルエンディアンバイトオーダーの Unicode UTF-16 です。

source: Unicode UTF-8, equivalent to CP65001.
ja: Unicode UTF-8、CP65001 と同等です。

source: Unicode character properties.
ja: Unicode 文字のプロパティ。

source: Unicode characters in the range 0 to 65535 (U+FFFF) are represented by a single 16-bit code unit of the same value, while characters in the range 65536 (U+10000) to 1114111 (U+10FFFF) are represented by a surrogate pair; that is, exactly two 16-bit code units between 0xD800 and 0xDFFF.
ja: 0から65535（U+FFFF）の範囲のユニコード文字は、同じ値の単一の16ビットコードユニットで表され、65536（U+10000）から1114111（U+10FFFF）の範囲の文字は、サロゲートペアで表されます。

source: Unicode characters may be generated by specifying a number between 256 and 65535 (without a leading zero).
ja: 256から65535までの数字（先頭のゼロを含まない）を指定することで、ユニコード文字を生成することができます。

source: Unicode versions of AutoHotkey use UTF-16.
ja: AutoHotkeyのUnicodeバージョンはUTF-16を使用します。

source: Unicode vs ANSI
ja: ユニコードとANSIの比較

source: Unidirectional sort.
ja: 単方向のソートです。

source: Uninitialized Variables
ja: 未初期化の変数

source: Unique ID/HWND
ja: ユニークID/HWND

source: Units to measure the difference in.
ja: 差を測る単位。

source: Unknown, Removable, Fixed, Network, CDROM, or RAMDisk.
ja: Unknown、Removable、Fixed、Network、CDROM、RAMDiskのいずれか。

source: Unless static Call() is overridden, this parameter is automatically passed to __New.
ja: static Call()がオーバーライドされない限り、このパラメータは自動的に__Newに渡される。

source: Unless the asterisk option is in effect, you must type an ending character after a hotstring's abbreviation to trigger it.
ja: アスタリスクオプションが有効でない限り、ホットストリングの後にエンディングキャラクターを入力しないと発動しません。

source: Unless the library is also registered as a general COM component, the CLR itself must first be manually initialized via DllCall.
ja: ライブラリが一般的なCOMコンポーネントとしても登録されていない限り、まずCLR自体をDllCallで手動で初期化する必要があります。

source: Unlike "Gui Color", Gui.BackColor does not affect Progress controls or disabled/read-only Edit, DDL, ComboBox or TreeView (with -Theme) controls.
ja: Gui。BackColorは、「Gui Color」とは異なり、Progressコントロールや、無効/読み取り専用のEdit、DDL、ComboBox、TreeView（-Theme付き）コントロールには影響しません。

source: Unlike "Gui Color", GuiObj.BackColor does not affect Progress controls or disabled/read-only Edit, DDL, ComboBox or TreeView (with -Theme) controls.
ja: GuiObj.BackColorは、"Gui Color"とは異なり、Progressコントロールや、無効/読み取り専用のEdit, DDL, ComboBox, TreeView（-Theme付き）コントロールには影響しません。

source: Unlike #MaxThreads, this setting is not global.
ja: #MaxThreadsとは異なり、この設定はグローバルではありません。

source: Unlike Add, this cannot be a position.
ja: Addとは異なり、ポジションにはなりえません。

source: Unlike ControlChooseIndex, this method does not raise a Change or DoubleClick event.
ja: ControlChooseIndexとは異なり、このメソッドはChangeまたはDoubleClickイベントを発生させません。

source: Unlike ControlChooseString, the entry's entire text must match, not just the leading part.
ja: ControlChooseStringとは異なり、エントリーの先頭部分だけでなく、テキスト全体が一致する必要があります。
